Revit 2024 API
ScheduleDefinition.IsFilteredBySheet Property
 Indicates if the schedule is set to filter by sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool IsFilteredBySheet { get; set; }
Visual Basic
Public Property IsFilteredBySheet As Boolean
	Get
	Set
Visual C++
public:
property bool IsFilteredBySheet {
	bool get ();
	void set (bool value);
}
Remarks
 If the schedule is set to filter by sheet, and it is placed on a particular sheet, the instance created will present only the elements visible in the Viewport(s) on that sheet.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The schedule category is not supported to use filter by sheet. -or- When setting this property: The Schedule is split already.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace